// Эта строка является комментарием и она будет проигнорирована компилятором\n
// Протестировать код можно нажав на кнопку "Run" вот тут ->\n
// так же можно использовать клавиатуру, нажав сочетание клавиш "Ctrl + Enter"\n
\n
// Этот код можно редактировать не стесняясь, дерзайте!\n
// Всегда можно вернуть оригинальный код, нажав на кнопку "Reset" вот тут ->\n
\n
// Это главная функция. С неё начинается исполнение любой программы\n
fn main() {\n
    // Следующий код будет исполнен в момент, когда будет запущен исполняемый файл\n
    // Отображаем текст в консоли\n
    println!("Привет, мир!");\n
}
